'''
Напишите программу, которая получает подстроку со 2-го по 5-й символ включительно и выводит ее на консоль. 
'''

string = 'hello world'


print(string[1:5])