'''
Напишите программу, которая получает последний символ строки и подстроку с последними 4-мя символами. 
'''


string = "hello world"

print(string[-1])
print(string[-4:])