'''

Пусть дан список-матрица, который содержит три списка:
    
mat = [
    [10, 20, 30],
    [40, 50, 60],
    [70, 80, 80]
]

Выведите всю матрицу в одном выражении.

Выведите по отдельности каждую строку матрицы.

Выведите по отдельности каждый элемент матрицы.

Пример работы программы:

mat:  [[10, 20, 30], [40, 50, 60], [70, 80, 90]]

mat[0]:  [10, 20, 30]
mat[1]:  [40, 50, 60]
mat[2]:  [70, 80, 90]

mat[0][0]:  10
mat[0][1]:  20
mat[0][2]:  30
mat[1][0]:  40
mat[1][1]:  50
mat[1][2]:  60
mat[2][0]:  70
mat[2][1]:  80
mat[2][2]:  90




'''

mat = [
    [10, 20, 30],
    [40, 50, 60],
    [70, 80, 80]
]

print("mat:",mat[0],mat[1],mat[2])
print('\n')
for i, m in enumerate(mat): print(f"mat[{i}]: [{m}]")
print('\n')

for i, m in enumerate(mat):
    for j, number in enumerate(mat[i]): print(f"mat[{i}][{j}]: {mat[i][j]}") 