'''
Напишите программу, которая располагает элементы списка в обратном порядке. 
'''


array = list([50,20,12,40])

array.reverse()

print(array)